workloads/YCSB_rocksdb/luma_test_logs/record_size_workloadA_logs/only_record_size/scext4_8dev_4KB
<YCSB RocksDB benchmark script>
load YCSB-a x1 & run YCSB-a x10..
*---------------------------------- ycsb load ----------------------------------*
[OVERALL], RunTime(ms), 350
[OVERALL], Throughput(ops/sec), 2857.1428571428573
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 23
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 6.571428571428571
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 23
[TOTAL_GC_TIME_%], Time(%), 6.571428571428571
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 66.8125
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 3775
[CLEANUP], 95thPercentileLatency(us), 25
[CLEANUP], 99thPercentileLatency(us), 37
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 2706.367
[INSERT], MinLatency(us), 37
[INSERT], MaxLatency(us), 19183
[INSERT], 95thPercentileLatency(us), 11463
[INSERT], 99thPercentileLatency(us), 15559
[INSERT], Return=OK, 1000
*---------------------------------- ycsb load end ------------------------------*
*---------------------------------- ycsb run_1 ----------------------------------*
[OVERALL], RunTime(ms), 188
[OVERALL], Throughput(ops/sec), 5319.148936170212
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 36
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 19.148936170212767
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 36
[TOTAL_GC_TIME_%], Time(%), 19.148936170212767
[READ], Operations, 503
[READ], AverageLatency(us), 850.2067594433399
[READ], MinLatency(us), 16
[READ], MaxLatency(us), 7359
[READ], 95thPercentileLatency(us), 3937
[READ], 99thPercentileLatency(us), 6419
[READ], Return=OK, 503
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 49.8125
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 2923
[CLEANUP], 95thPercentileLatency(us), 12
[CLEANUP], 99thPercentileLatency(us), 14
[UPDATE], Operations, 497
[UPDATE], AverageLatency(us), 1658.4245472837022
[UPDATE], MinLatency(us), 86
[UPDATE], MaxLatency(us), 7931
[UPDATE], 95thPercentileLatency(us), 3869
[UPDATE], 99thPercentileLatency(us), 5399
[UPDATE], Return=OK, 497
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_2 ----------------------------------*
[OVERALL], RunTime(ms), 167
[OVERALL], Throughput(ops/sec), 5988.023952095808
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 24
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 14.37125748502994
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 24
[TOTAL_GC_TIME_%], Time(%), 14.37125748502994
[READ], Operations, 474
[READ], AverageLatency(us), 534.8502109704641
[READ], MinLatency(us), 13
[READ], MaxLatency(us), 5807
[READ], 95thPercentileLatency(us), 3143
[READ], 99thPercentileLatency(us), 4495
[READ], Return=OK, 474
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 45.640625
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 2685
[CLEANUP], 95thPercentileLatency(us), 7
[CLEANUP], 99thPercentileLatency(us), 7
[UPDATE], Operations, 526
[UPDATE], AverageLatency(us), 1916.690114068441
[UPDATE], MinLatency(us), 55
[UPDATE], MaxLatency(us), 5947
[UPDATE], 95thPercentileLatency(us), 4395
[UPDATE], 99thPercentileLatency(us), 5243
[UPDATE], Return=OK, 526
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_3 ----------------------------------*
[OVERALL], RunTime(ms), 175
[OVERALL], Throughput(ops/sec), 5714.285714285715
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 24
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 13.714285714285715
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 24
[TOTAL_GC_TIME_%], Time(%), 13.714285714285715
[READ], Operations, 496
[READ], AverageLatency(us), 940.7116935483871
[READ], MinLatency(us), 5
[READ], MaxLatency(us), 5119
[READ], 95thPercentileLatency(us), 3723
[READ], 99thPercentileLatency(us), 5039
[READ], Return=OK, 496
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 50.8125
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 2981
[CLEANUP], 95thPercentileLatency(us), 9
[CLEANUP], 99thPercentileLatency(us), 16
[UPDATE], Operations, 504
[UPDATE], AverageLatency(us), 2547.468253968254
[UPDATE], MinLatency(us), 92
[UPDATE], MaxLatency(us), 8003
[UPDATE], 95thPercentileLatency(us), 5303
[UPDATE], 99thPercentileLatency(us), 6195
[UPDATE], Return=OK, 504
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_4 ----------------------------------*
[OVERALL], RunTime(ms), 177
[OVERALL], Throughput(ops/sec), 5649.717514124294
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 30
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 16.94915254237288
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 30
[TOTAL_GC_TIME_%], Time(%), 16.94915254237288
[READ], Operations, 491
[READ], AverageLatency(us), 872.3747454175153
[READ], MinLatency(us), 10
[READ], MaxLatency(us), 6275
[READ], 95thPercentileLatency(us), 2943
[READ], 99thPercentileLatency(us), 3967
[READ], Return=OK, 491
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 52.140625
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 3013
[CLEANUP], 95thPercentileLatency(us), 12
[CLEANUP], 99thPercentileLatency(us), 16
[UPDATE], Operations, 509
[UPDATE], AverageLatency(us), 2884.8860510805503
[UPDATE], MinLatency(us), 82
[UPDATE], MaxLatency(us), 9415
[UPDATE], 95thPercentileLatency(us), 6219
[UPDATE], 99thPercentileLatency(us), 7503
[UPDATE], Return=OK, 509
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_5 ----------------------------------*
[OVERALL], RunTime(ms), 180
[OVERALL], Throughput(ops/sec), 5555.555555555556
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 24
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 13.333333333333334
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 24
[TOTAL_GC_TIME_%], Time(%), 13.333333333333334
[READ], Operations, 514
[READ], AverageLatency(us), 926.9066147859922
[READ], MinLatency(us), 17
[READ], MaxLatency(us), 6447
[READ], 95thPercentileLatency(us), 4607
[READ], 99thPercentileLatency(us), 6115
[READ], Return=OK, 514
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 46.46875
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 2771
[CLEANUP], 95thPercentileLatency(us), 7
[CLEANUP], 99thPercentileLatency(us), 12
[UPDATE], Operations, 486
[UPDATE], AverageLatency(us), 2398.3888888888887
[UPDATE], MinLatency(us), 68
[UPDATE], MaxLatency(us), 7527
[UPDATE], 95thPercentileLatency(us), 5275
[UPDATE], 99thPercentileLatency(us), 6607
[UPDATE], Return=OK, 486
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_6 ----------------------------------*
[OVERALL], RunTime(ms), 175
[OVERALL], Throughput(ops/sec), 5714.285714285715
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 23
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 13.142857142857142
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 23
[TOTAL_GC_TIME_%], Time(%), 13.142857142857142
[READ], Operations, 501
[READ], AverageLatency(us), 794.8323353293413
[READ], MinLatency(us), 16
[READ], MaxLatency(us), 5671
[READ], 95thPercentileLatency(us), 2627
[READ], 99thPercentileLatency(us), 4603
[READ], Return=OK, 501
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 43.140625
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 2487
[CLEANUP], 95thPercentileLatency(us), 10
[CLEANUP], 99thPercentileLatency(us), 14
[UPDATE], Operations, 499
[UPDATE], AverageLatency(us), 3011.617234468938
[UPDATE], MinLatency(us), 45
[UPDATE], MaxLatency(us), 11231
[UPDATE], 95thPercentileLatency(us), 6371
[UPDATE], 99thPercentileLatency(us), 8703
[UPDATE], Return=OK, 499
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_7 ----------------------------------*
[OVERALL], RunTime(ms), 176
[OVERALL], Throughput(ops/sec), 5681.818181818182
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 24
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 13.636363636363635
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 24
[TOTAL_GC_TIME_%], Time(%), 13.636363636363635
[READ], Operations, 508
[READ], AverageLatency(us), 942.5196850393701
[READ], MinLatency(us), 14
[READ], MaxLatency(us), 7695
[READ], 95thPercentileLatency(us), 5415
[READ], 99thPercentileLatency(us), 7459
[READ], Return=OK, 508
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 51.46875
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 3093
[CLEANUP], 95thPercentileLatency(us), 7
[CLEANUP], 99thPercentileLatency(us), 10
[UPDATE], Operations, 492
[UPDATE], AverageLatency(us), 2464.7195121951218
[UPDATE], MinLatency(us), 57
[UPDATE], MaxLatency(us), 7443
[UPDATE], 95thPercentileLatency(us), 5567
[UPDATE], 99thPercentileLatency(us), 6595
[UPDATE], Return=OK, 492
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_8 ----------------------------------*
[OVERALL], RunTime(ms), 184
[OVERALL], Throughput(ops/sec), 5434.782608695652
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 32
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 17.391304347826086
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 32
[TOTAL_GC_TIME_%], Time(%), 17.391304347826086
[READ], Operations, 512
[READ], AverageLatency(us), 649.89453125
[READ], MinLatency(us), 12
[READ], MaxLatency(us), 5923
[READ], 95thPercentileLatency(us), 2427
[READ], 99thPercentileLatency(us), 4611
[READ], Return=OK, 512
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 47.046875
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 2735
[CLEANUP], 95thPercentileLatency(us), 10
[CLEANUP], 99thPercentileLatency(us), 14
[UPDATE], Operations, 488
[UPDATE], AverageLatency(us), 2186.2274590163934
[UPDATE], MinLatency(us), 38
[UPDATE], MaxLatency(us), 6935
[UPDATE], 95thPercentileLatency(us), 5087
[UPDATE], 99thPercentileLatency(us), 5879
[UPDATE], Return=OK, 488
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_9 ----------------------------------*
[OVERALL], RunTime(ms), 160
[OVERALL], Throughput(ops/sec), 6250.0
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 15
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 9.375
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 15
[TOTAL_GC_TIME_%], Time(%), 9.375
[READ], Operations, 490
[READ], AverageLatency(us), 505.3387755102041
[READ], MinLatency(us), 13
[READ], MaxLatency(us), 8255
[READ], 95thPercentileLatency(us), 2041
[READ], 99thPercentileLatency(us), 2957
[READ], Return=OK, 490
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 52.4375
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 3109
[CLEANUP], 95thPercentileLatency(us), 10
[CLEANUP], 99thPercentileLatency(us), 16
[UPDATE], Operations, 510
[UPDATE], AverageLatency(us), 2958.6470588235293
[UPDATE], MinLatency(us), 63
[UPDATE], MaxLatency(us), 12471
[UPDATE], 95thPercentileLatency(us), 6347
[UPDATE], 99thPercentileLatency(us), 8063
[UPDATE], Return=OK, 510
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_10 ----------------------------------*
[OVERALL], RunTime(ms), 265
[OVERALL], Throughput(ops/sec), 3773.5849056603774
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 48
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 18.11320754716981
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 48
[TOTAL_GC_TIME_%], Time(%), 18.11320754716981
[READ], Operations, 517
[READ], AverageLatency(us), 454.6441005802708
[READ], MinLatency(us), 5
[READ], MaxLatency(us), 4043
[READ], 95thPercentileLatency(us), 1486
[READ], 99thPercentileLatency(us), 3549
[READ], Return=OK, 517
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 58.40625
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 3505
[CLEANUP], 95thPercentileLatency(us), 11
[CLEANUP], 99thPercentileLatency(us), 14
[UPDATE], Operations, 483
[UPDATE], AverageLatency(us), 9861.24016563147
[UPDATE], MinLatency(us), 107
[UPDATE], MaxLatency(us), 18783
[UPDATE], 95thPercentileLatency(us), 17583
[UPDATE], 99thPercentileLatency(us), 17791
[UPDATE], Return=OK, 483
*---------------------------------- ycsb run end ------------------------------*
experiment end.